iNavFlight/inav/lib/main/ChibiOS/os/hal/ports/SPC5/SPC57EMxx/hal_lld.h
/* Check on SPC5_PLL0_PREDIV_VALUE.*/
#if (SPC5_PLL0_PREDIV_VALUE < 0) || (SPC5_PLL0_PREDIV_VALUE > 7)
#error "invalid SPC5_PLL0_PREDIV_VALUE value specified"
#endif

/* Check on SPC5_PLL0_MFD_VALUE.*/
#if (SPC5_PLL0_MFD_VALUE < 8) || (SPC5_PLL0_MFD_VALUE > 127)
#error "invalid SPC5_PLL0_MFD_VALUE value specified"
#endif

/* Check on SPC5_PLL0_RFDPHI_VALUE.*/
#if (SPC5_PLL0_RFDPHI_VALUE < 1) || (SPC5_PLL0_RFDPHI_VALUE > 63)
#error "invalid SPC5_PLL0_RFDPHI_VALUE value specified"
#endif

/* Check on SPC5_PLL0_RFDPHI1_VALUE.*/
#if (SPC5_PLL0_RFDPHI1_VALUE < 4) || (SPC5_PLL0_RFDPHI1_VALUE > 15)
#error "invalid SPC5_PLL0_RFDPHI1_VALUE value specified"
#endif

/* Check on SPC5_PLL1_MFD_VALUE.*/
#if (SPC5_PLL1_MFD_VALUE < 16) || (SPC5_PLL1_MFD_VALUE > 34)
#error "invalid SPC5_PLL1_MFD_VALUE value specified"
#endif

/* Check on SPC5_PLL1_RFDPHI_VALUE.*/
#if (SPC5_PLL1_RFDPHI_VALUE < 2) || (SPC5_PLL1_RFDPHI_VALUE > 126) ||       \
    ((SPC5_PLL1_RFDPHI_VALUE & 1) != 0)
#error "invalid SPC5_PLL1_RFDPHI_VALUE value specified"
#endif

/*-----------------------------------------*
 * Mux-related checks and assignments.     *
 *-----------------------------------------*/

/* Check on SPC5_CGM_AC0_SC_BITS.*/
#if SPC5_CGM_AC0_SC_BITS == SPC5_CGM_SC_IRC
#define SPC5_AUX0_CLK                       SPC5_IRC_CLK
#elif SPC5_CGM_AC0_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_AUX0_CLK                       SPC5_XOSC_CLK
#elif SPC5_CGM_AC0_SC_BITS == SPC5_CGM_SC_PLL0PHI
#define SPC5_AUX0_CLK                       SPC5_PLL0_PHI_CLK
#else
#error "invalid SPC5_CGM_AC0_SC_BITS value specified"
#endif

/* Check on SPC5_CGM_AC3_SC_BITS.*/
#if SPC5_CGM_AC3_SC_BITS == SPC5_CGM_SC_IRC
#define SPC5_PLL0_INPUT_CLK                 SPC5_IRC_CLK
#elif SPC5_CGM_AC3_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_PLL0_INPUT_CLK                 SPC5_XOSC_CLK
#else
#error "invalid SPC5_CGM_AC3_SC_BITS value specified"
#endif

/* Check on SPC5_CGM_AC4_SC_BITS.*/
#if SPC5_CGM_AC4_SC_BITS == SPC5_CGM_SC_PLL0PHI1
#define SPC5_PLL1_INPUT_CLK                 SPC5_PLL0_PHI1_CLK
#elif SPC5_CGM_AC4_SC_BITS == SPC5_CGM_SC_XOSC
#define SPC5_PLL1_INPUT_CLK                 SPC5_XOSC_CLK
#else
#error "invalid SPC5_CGM_AC4_SC_BITS value specified"
#endif

/*-----------------------------------------*
 * Dividers-related checks.                *
 *-----------------------------------------*/

/* Check on the SC divider 0 settings.*/
#if SPC5_CGM_SC_DC0_DIV_VALUE == 0
#define SPC5_CGM_SC_DC0_BITS                0
#elif (SPC5_CGM_SC_DC0_DIV_VALUE >= 1) && (SPC5_CGM_SC_DC0_DIV_VALUE <= 16)
#define SPC5_CGM_SC_DC0_BITS                (0x80000000U |                  \
                                             ((SPC5_CGM_SC_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_SC_DC0_DIV_VALUE value specified"
#endif

/* Check on the SC divider 1 settings.*/
#if SPC5_CGM_SC_DC1_DIV_VALUE == 0
#define SPC5_CGM_SC_DC1_BITS                0
#elif (SPC5_CGM_SC_DC1_DIV_VALUE >= 1) && (SPC5_CGM_SC_DC1_DIV_VALUE <= 16)
#define SPC5_CGM_SC_DC1_BITS                (0x80000000U |                  \
                                             ((SPC5_CGM_SC_DC1_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_SC_DC1_DIV_VALUE value specified"
#endif

/* Check on the SC divider 2 settings.*/
#if SPC5_CGM_SC_DC2_DIV_VALUE == 0
#define SPC5_CGM_SC_DC2_BITS                0
#elif (SPC5_CGM_SC_DC2_DIV_VALUE >= 1) && (SPC5_CGM_SC_DC2_DIV_VALUE <= 16)
#define SPC5_CGM_SC_DC2_BITS                (0x80000000U |                  \
                                             ((SPC5_CGM_SC_DC2_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_SC_DC2_DIV_VALUE value specified"
#endif

/* Check on the AUX0 divider 0 settings.*/
#if SPC5_CGM_AC0_DC0_DIV_VALUE == 0
#define SPC5_CGM_AC0_DC0_BITS               0
#elif (SPC5_CGM_AC0_DC0_DIV_VALUE >= 1) && (SPC5_CGM_AC0_DC0_DIV_VALUE <= 16)
#define SPC5_CGM_AC0_DC0_BITS               (0x80000000U |                  \
                                             ((SPC5_CGM_AC0_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC0_DC0_DIV_VALUE value specified"
#endif

/* Check on the AUX0 divider 1 settings.*/
#if SPC5_CGM_AC0_DC1_DIV_VALUE == 0
#define SPC5_CGM_AC0_DC1_BITS               0
#elif (SPC5_CGM_AC0_DC1_DIV_VALUE >= 1) && (SPC5_CGM_AC0_DC1_DIV_VALUE <= 128)
#define SPC5_CGM_AC0_DC1_BITS               (0x80000000U |                  \
                                             ((SPC5_CGM_AC0_DC1_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC0_DC1_DIV_VALUE value specified"
#endif

/* Check on the AUX0 divider 2 settings.*/
#if SPC5_CGM_AC0_DC2_DIV_VALUE == 0
#define SPC5_CGM_AC0_DC2_BITS               0
#elif (SPC5_CGM_AC0_DC2_DIV_VALUE >= 1) && (SPC5_CGM_AC0_DC2_DIV_VALUE <= 128)
#define SPC5_CGM_AC0_DC2_BITS               (0x80000000U |                  \
                                             ((SPC5_CGM_AC0_DC2_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC0_DC2_DIV_VALUE value specified"
#endif

/* Check on the AUX0 divider 3 multiplier settings.*/
#if SPC5_CGM_AC0_DC3_DIV_FMT_VALUE == 1
#define SPC5_CGM_AC0_DC3_DIV_FMT            SPC5_CGM_DIV_FMT_DIV1
#elif SPC5_CGM_AC0_DC3_DIV_FMT_VALUE == 10
#define SPC5_CGM_AC0_DC3_DIV_FMT            SPC5_CGM_DIV_FMT_DIV10
#elif SPC5_CGM_AC0_DC3_DIV_FMT_VALUE == 100
#define SPC5_CGM_AC0_DC3_DIV_FMT            SPC5_CGM_DIV_FMT_DIV100
#elif SPC5_CGM_AC0_DC3_DIV_FMT_VALUE == 1000
#define SPC5_CGM_AC0_DC3_DIV_FMT            SPC5_CGM_DIV_FMT_DIV1000
#else
#error "invalid SPC5_CGM_AC0_DC3_DIV_FMT_VALUE value specified"
#endif

/* Check on the AUX0 divider 3 settings.*/
#if SPC5_CGM_AC0_DC3_DIV_VALUE == 0
#define SPC5_CGM_AC0_DC3_BITS               0
#elif (SPC5_CGM_AC0_DC3_DIV_VALUE >= 1) && (SPC5_CGM_AC0_DC3_DIV_VALUE <= 512)
#define SPC5_CGM_AC0_DC3_BITS               (0x80000000U |                  \
                                             SPC5_CGM_AC0_DC3_DIV_FMT |     \
                                             ((SPC5_CGM_AC0_DC3_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC0_DC3_DIV_VALUE value specified"
#endif

