iNavFlight/inav/lib/main/ChibiOS/os/hal/ports/SPC5/SPC57EMxx/hal_lld.h
/* Check on the AUX0 divider 4 settings.*/
#if SPC5_CGM_AC0_DC4_DIV_VALUE == 0
#define SPC5_CGM_AC0_DC4_BITS               0
#elif (SPC5_CGM_AC0_DC4_DIV_VALUE >= 1) && (SPC5_CGM_AC0_DC4_DIV_VALUE <= 16)
#define SPC5_CGM_AC0_DC4_BITS               (0x80000000U |                 \
                                             ((SPC5_CGM_AC0_DC4_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC0_DC4_DIV_VALUE value specified"
#endif

/* Check on the AUX6 divider 0 settings.*/
#if SPC5_CGM_AC6_DC0_DIV_VALUE == 0
#define SPC5_CGM_AC6_DC0_BITS               0
#elif (SPC5_CGM_AC6_DC0_DIV_VALUE >= 1) && (SPC5_CGM_AC6_DC0_DIV_VALUE <= 512)
#define SPC5_CGM_AC6_DC0_BITS               (0x80000000U |                 \
                                             ((SPC5_CGM_AC6_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC6_DC0_DIV_VALUE value specified"
#endif

/* Check on the AUX7 divider 0 settings.*/
#if SPC5_CGM_AC7_DC0_DIV_VALUE == 0
#define SPC5_CGM_AC7_DC0_BITS               0
#elif (SPC5_CGM_AC7_DC0_DIV_VALUE >= 1) && (SPC5_CGM_AC7_DC0_DIV_VALUE <= 512)
#define SPC5_CGM_AC7_DC0_BITS               (0x80000000U |                 \
                                             ((SPC5_CGM_AC7_DC0_DIV_VALUE - 1) << 16))
#else
#error "invalid SPC5_CGM_AC7_DC0_DIV_VALUE value specified"
#endif

/*-----------------------------------------*
 * Clock points calculation and check.     *
 *-----------------------------------------*/

/**
 * @brief   SPC5_PLL0_VCO_CLK clock point.
 */
#define SPC5_PLL0_VCO_CLK                                                   \
  ((SPC5_PLL0_INPUT_CLK / SPC5_PLL0_PREDIV_VALUE) * SPC5_PLL0_MFD_VALUE)

/* Check on PLL0 VCO output.*/
#if (SPC5_PLL0_VCO_CLK < SPC5_PLL0VCO_MIN) ||                               \
    (SPC5_PLL0_VCO_CLK > SPC5_PLL0VCO_MAX)
#error "SPC5_PLL0_VCO_CLK outside acceptable range (SPC5_PLL0VCO_MIN...SPC5_PLL0VCO_MAX)"
#endif

/**
 * @brief   SPC5_PLL0_PHI_CLK clock point.
 */
#define SPC5_PLL0_PHI_CLK                                                   \
  (SPC5_PLL0_VCO_CLK / SPC5_PLL0_RFDPHI_VALUE)

/* Check on SPC5_PLL0_PHI_CLK.*/
#if ((SPC5_PLL0_PHI_CLK > SPC5_PLL0_CLK_MAX) ||                             \
     (SPC5_PLL0_PHI_CLK < SPC5_PLL0_CLK_MIN)) && !SPC5_ALLOW_OVERCLOCK
#error "SPC5_PLL0_PHI_CLK outside acceptable range (SPC5_PLL0_CLK_MIN...SPC5_PLL0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_PLL0_PHI1_CLK clock point.
 */
#define SPC5_PLL0_PHI1_CLK                                                  \
  (SPC5_PLL0_VCO_CLK / SPC5_PLL0_RFDPHI1_VALUE)

/* Check on SPC5_PLL0_PH1I_CLK.*/
#if ((SPC5_PLL0_PHI1_CLK > SPC5_PLL0_CLK_MAX) ||                            \
     (SPC5_PLL0_PHI1_CLK < SPC5_PLL0_CLK_MIN)) && !SPC5_ALLOW_OVERCLOCK
#error "SPC5_PLL0_PHI1_CLK outside acceptable range (SPC5_PLL0_CLK_MIN...SPC5_PLL0_CLK_MAX)"
#endif

/**
 * @brief   SPC5_PLL1_VCO_CLK clock point.
 */
#define SPC5_PLL1_VCO_CLK                                                   \
  (SPC5_PLL1_INPUT_CLK* SPC5_PLL1_MFD_VALUE)

/* Check on PLL1 VCO output.*/
#if (SPC5_PLL1_VCO_CLK < SPC5_PLL1VCO_MIN) ||                               \
    (SPC5_PLL1_VCO_CLK > SPC5_PLL1VCO_MAX)
#error "SPC5_PLL10_VCO_CLK outside acceptable range (SPC5_PLL1VCO_MIN...SPC5_PLL1VCO_MAX)"
#endif

/**
 * @brief   SPC5_PLL1_PHI_CLK clock point.
 * @note    The calculation is still wrong in the rev.5 RM.
 */
#define SPC5_PLL1_PHI_CLK                                                   \
  ((SPC5_PLL1_VCO_CLK / SPC5_PLL1_RFDPHI_VALUE) / 2)

/* Check on SPC5_PLL1_PHI_CLK.*/
#if ((SPC5_PLL1_PHI_CLK > SPC5_PLL1_CLK_MAX) ||                             \
     (SPC5_PLL1_PHI_CLK < SPC5_PLL1_CLK_MIN)) && !SPC5_ALLOW_OVERCLOCK
#error "SPC5_PLL1_PHI_CLK outside acceptable range (SPC5_PLL1_CLK_MIN...SPC5_PLL1_CLK_MAX)"
#endif

/**
 * @brief   PER_CLK clock point.
 */
#define SPC5_PER_CLK                                                        \
  (SPC5_AUX0_CLK / SPC5_CGM_AC0_DC0_DIV_VALUE)

/* Check on SPC5_PER_CLK.*/
#if SPC5_PER_CLK > SPC5_PER_CLK_MAX
#error "SPC5_PER_CLK outside acceptable range (0...SPC5_PER_CLK_MAX)"
#endif

/**
 * @brief   SD_CLK clock point.
 */
#define SPC5_SD_CLK                                                         \
  (SPC5_AUX0_CLK / SPC5_CGM_AC0_DC1_DIV_VALUE)

/* Check on SPC5_PER_CLK.*/
#if SPC5_SD_CLK > SPC5_SD_CLK_MAX
#error "SPC5_SD_CLK outside acceptable range (0...SPC5_SD_CLK_MAX)"
#endif

/**
 * @brief   SAR_CLK clock point.
 */
#define SPC5_SAR_CLK                                                        \
  (SPC5_AUX0_CLK / SPC5_CGM_AC0_DC2_DIV_VALUE)

/* Check on SPC5_SAR_CLK.*/
#if SPC5_SAR_CLK > SPC5_SAR_CLK_MAX
#error "SPC5_SAR_CLK outside acceptable range (0...SPC5_SAR_CLK_MAX)"
#endif

/**
 * @brief   DSPI0_CLK clock point.
 */
#define SPC5_DSPI0_CLK                                                      \
  (SPC5_AUX0_CLK / (SPC5_CGM_AC0_DC3_DIV_VALUE *                            \
                    SPC5_CGM_AC0_DC3_DIV_FMT_VALUE))

/* Check on SPC5_DSPI0_CLK.*/
#if SPC5_DSPI0_CLK > SPC5_DSPI0_CLK_MAX
#error "SPC5_DSPI0_CLK outside acceptable range (0...SPC5_DSPI0_CLK_MAX)"
#endif

/**
 * @brief   DSPI1_CLK and LIN_CLK clock point.
 */
#define SPC5_DSPI1_CLK_LIN_CLK                                              \
  (SPC5_AUX0_CLK / SPC5_CGM_AC0_DC4_DIV_VALUE)

/* Check on SPC5_DSPI1_CLK_LIN_CLK.*/
#if SPC5_DSPI1_CLK_LIN_CLK > SPC5_DSPI1_CLK_LIN_CLK_MAX
#error "SPC5_DSPI1_CLK_LIN_CLK outside acceptable range (0...SPC5_DSPI1_CLK_LIN_CLK_MAX)"
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type representing a system clock frequency.
 */
typedef uint32_t halclock_t;

/**
 * @brief   Type of the realtime free counter value.
 */
typedef uint32_t halrtcnt_t;

/**
 * @brief   Run modes.
 */
typedef enum {
  SPC5_RUNMODE_SAFE  = 2,
  SPC5_RUNMODE_DRUN  = 3,
  SPC5_RUNMODE_RUN0  = 4,
  SPC5_RUNMODE_RUN1  = 5,
  SPC5_RUNMODE_RUN2  = 6,
  SPC5_RUNMODE_RUN3  = 7,
  SPC5_RUNMODE_HALT0 = 8,
  SPC5_RUNMODE_STOP0 = 10
} spc5_runmode_t;

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Returns the current value of the system free running counter.
 * @note    This service is implemented by returning the content of the
 *          TBL register.
 *
 * @return              The value of the system free running counter of
 *                      type halrtcnt_t.
 *
 * @notapi
 */
static inline
halrtcnt_t hal_lld_get_counter_value(void) {
  halrtcnt_t cnt;

  asm volatile ("mfspr   %[cnt], 284" : [cnt] "=r" (cnt) : : );
  return cnt;
}

/**
 * @brief   Realtime counter frequency.
 *
 * @return              The realtime counter frequency of type halclock_t.
 *
 * @notapi
 */
#define hal_lld_get_counter_frequency() (halclock_t)halSPCGetSystemClock()

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/*#include "spc5_edma.h"*/

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void spc_clock_init(void);
  bool halSPCSetRunMode(spc5_runmode_t mode);
  void halSPCSetPeripheralClockMode(uint32_t n, uint32_t pctl);
#if !SPC5_NO_INIT
  uint32_t halSPCGetSystemClock(void);
#endif
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
